#หาพื้นที่สี่เหลี่ยม เเละสามเหลี่ยม โดยรับกว้าง ยาว/ฐาน สูง ทางเเป้นพิมพ์ เเละเเสดงผลทางหน้าจอ
#feature การทำงานอะไรบ้าง
#1.รับค่า กว้างยาว 2.รับค่า ฐาน สูง 
#3.คำนวนพื้นที่ สี่เหลี่ยม เเละเเสดงพื้นที่สี่เหลี่ยม 4.คำนวนพื้นที่ สามเหลี่ยม เเละเเสดงพื้นที่สามเหลี่ยม
def WL():
    W = float(input("กว้าง :"))
    L = float(input("ยาว :"))
    return W , L

def BH():
    B = float(input("ฐาน :"))
    H = float(input("สูง :"))
    return B ,H

def CalAreaS(W,L):
    area = W * L
    print(f"สี่เหลี่ยมกว้าง {W} ยาว {L} มีพื้นที่ {area}")

def CalAreaT(B,H):
    area = B * H / 2
    print(f"สามเหลี่ยมกว้าง {B} ยาว {H} มีพื้นที่ {area}")

W , L = WL()
CalAreaS(W,L)
print("......................")
B , H = BH()
CalAreaT(B, H)